tests/load/scenarios.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"

scenarios:
  - name: "Validate single email"
    flow:
      - post:
          url: "/api/validate/email"
          json:
            email: "test@example.com"
          expect:
            - statusCode: 200
            - contentType: "application/json"

  - name: "Validate bulk emails"
    flow:
      - post:
          url: "/api/validate/bulk"
          json:
            emails: 
              - "test1@example.com"
              - "test2@example.com"
              - "test3@example.com"
          expect:
            - statusCode: 200
            - contentType: "application/json"

  - name: "Cache hit scenario"
    flow:
      - post:
          url: "/api/validate/email"
          json:
            email: "cached@example.com"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - think: 1
      - post:
          url: "/api/validate/email"
          json:
            email: "cached@example.com"
          expect:
            - statusCode: 200
            - contentType: "application/json"